#Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных
# каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя,
# а указать явно, в программе.

New_list = [1, 2.5, "Юольшое число", 725, 254.6, 1212]
for i in range(len(New_list)):
    print(i, "-й элемент списка", type(New_list[i]))






