# Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет
# добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к
# полученной ранее сумме и после этого завершить программу.

def my_sum(numbers):
    if '$' in numbers:
        numbers = numbers.split('$')[0]
    return sum(map(int, numbers.split()))


s = 0
numbers = ''
while '$' not in numbers:
    numbers = input('Input numbers')
    s += my_sum(numbers)
    print(s)